# Construction Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Construction Class
Members See Also
---
Construction definition for Project Information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Construction
```

Visual Basic
---
```text
Public Class Construction
```

Visual C++
---
```text
public ref class Construction
```

# Remarks
This is used to define the information in Constructions.xml.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Construction
# See Also
Construction Members
Autodesk.Revit.DB Namespace